<a href="https://colab.research.google.com/github/jmartinbellido/DMBA/blob/main/DMBA3_Python_Notebook3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **ISDI DMBA**
# Introduction to Python for Data Analysis - Notebook 3
---

### TABLE OF CONTENTS
1. DATA CLEANING
2. NORMALIZE VARIABLES
3. MERGE DATASETS
4. EXERCISES

### Lecturer: Juan Martin Bellido (jmbelldo@isdi.education)

In [ ]:
# importing libraries
import pandas as pd
import numpy as np
from scipy import stats

# DATA CLEANING

In [ ]:
# Import df
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")

### Null Values
---

#### Identify null values in a DataFrame

The first step is to check if there are indeed null values in the DataFrame and identify on which field.

There are two functions that will help us with this,

```
isna(object)
```
> *The isna() method test if values are NaN (True) or not (False)*

```
any(boolean object)
```
> *The any() method test if at least one of the boolean elements is True*

In [ ]:
# Step 1: apply isna() method to the whole DataFrame to test for NaN values
nan_values = df_jamesbond.isna() # we store the result in a new object
nan_values # let us visualize the object to see what we are doing

                                  Year  Actor  ...  Budget  Bond Actor Salary
Film                                           ...
Dr. No                           False  False  ...   False              False
From Russia with Love            False  False  ...   False              False
Goldfinger                       False  False  ...   False              False
Thunderball                      False  False  ...   False              False
Casino Royale                    False  False  ...   False               True
You Only Live Twice              False  False  ...   False              False
On Her Majesty's Secret Service  False  False  ...   False              False
Diamonds Are Forever             False  False  ...   False              False
Live and Let Die                 False  False  ...   False               True
The Man with the Golden Gun      False  False  ...   False               True
The Spy Who Loved Me             False  False  ...   False               True
Moonraker                        False  False  ...   False               True
For Your Eyes Only               False  False  ...   False               True
Never Say Never Again            False  False  ...   False               True
Octopussy                        False  False  ...   False              False
A View to a Kill                 False  False  ...   False              False
The Living Daylights             False  False  ...   False              False
Licence to Kill                  False  False  ...   False              False
GoldenEye                        False  False  ...   False              False
Tomorrow Never Dies              False  False  ...   False              False
The World Is Not Enough          False  False  ...   False              False
Die Another Day                  False  False  ...   False              False
Casino Royale                    False  False  ...   False              False
Quantum of Solace                False  False  ...   False              False
Skyfall                          False  False  ...   False              False
Spectre                          False  False  ...   False               True

[26 rows x 6 columns]

In [ ]:
# Step 2: test if at least one value for each column is True (null)
nan_columns = nan_values.any() # we apply any() to nan_values and store that in a new object
nan_columns # let us visualize what we built
# note: once visualizing the result, we observe that there are NaN values for field "Bond Actor Salary"

Year                 False
Actor                False
Director             False
Box Office           False
Budget               False
Bond Actor Salary     True
dtype: bool

#### Operate null values in DataFrame
Once identifying null values, we can decide whether to, 
*   remove full rows with at least one missing value; or 
*   fill null values

In [ ]:
# We identified NA values in column "Bond Actor Salary", we will now proceed to omit those rows
cond = df_jamesbond["Bond Actor Salary"].isnull()
df_jamesbond[-cond] # we negate condition to omit those rows that are NA for column "Bond Actor Salary"

                                 Year  ... Bond Actor Salary
Film                                   ...
Dr. No                           1962  ...               0.6
From Russia with Love            1963  ...               1.6
Goldfinger                       1964  ...               3.2
Thunderball                      1965  ...               4.7
You Only Live Twice              1967  ...               4.4
On Her Majesty's Secret Service  1969  ...               0.6
Diamonds Are Forever             1971  ...               5.8
Octopussy                        1983  ...               7.8
A View to a Kill                 1985  ...               9.1
The Living Daylights             1987  ...               5.2
Licence to Kill                  1989  ...               7.9
GoldenEye                        1995  ...               5.1
Tomorrow Never Dies              1997  ...              10.0
The World Is Not Enough          1999  ...              13.5
Die Another Day                  2002  ...              17.9
Casino Royale                    2006  ...               3.3
Quantum of Solace                2008  ...               8.1
Skyfall                          2012  ...              14.5

[18 rows x 6 columns]

In [ ]:
# De forma alternativa (no recomendable para este ejemplo en concreto), podríamos optar por reeplazar valores NA

# Alternatively, we could opt to fill NAs
# In this specific case, let us fill NAs with the mean for the rest of not NA values

median_bond_salary = df_jamesbond["Bond Actor Salary"].mean() # we calculate the mean
df_jamesbond["Bond Actor Salary"]=df_jamesbond["Bond Actor Salary"].fillna(median_bond_salary) # we replace null values

# Note: in some other cases, we might just want to replace null values by 0 -> .fillna(0)

### Duplicated values
---

In [ ]:
# Import df
df_duplicates = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/renfe_estaciones_duplicates.csv")

#### Identify duplicated values

Key functions in this section,
```
object.duplicated()
```
> *The duplicated() method test if a row is an exact duplicate*

In [ ]:
len(df_duplicates) # check number of rows

630

In [ ]:
# identify duplicated rows
cond = df_duplicates.duplicated()
df_duplicates[cond]

     CODIGO            DESCRIPCION  ...    PROVINCIA    PAIS
16     5000                GRANADA  ...      Granada  España
24    10204              ZARZALEJO  ...       Madrid  España
57    11208        VITORIA/GASTEIZ  ...  Araba/Álava  España
74    11203               MANZANOS  ...  Araba/Álava  España
90    15006               CISNEROS  ...     Palencia  España
181   23004             PONTEVEDRA  ...   Pontevedra  España
222   31205               A GUDIÑA  ...      Ourense  España
227   34005   SAN PEDRO DEL ARROYO  ...        Ávila  España
242   35206  NAVALMORAL DE LA MATA  ...      Cáceres  España
253   37300            PUERTOLLANO  ...  Ciudad Real  España

[10 rows x 9 columns]

#### Remove duplicated values

Key functions in this section,
```
object.drop_duplicates()
```
> *The drop_duplicates() method removes duplicated rows*

In [ ]:
df_clean = df_duplicates.drop_duplicates() # we remove duplicates and store the output in a new object

In [ ]:
len(df_clean) # we check again number of rows to confirm new number

620

# IDENTIFY OUTLIERS

In [ ]:
df_jamesbond = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/jamesbond.csv",index_col="Film")

It is important to identify outliers in numerical fields. Depending on the case, we might only want to check for possible data entry errors or to remove outliers (even when those are not errors).

There are different way to identify outliers in a DataFrame, in this course we will introduce one of the simplest: *normalizing the variable to Z*. For this method, we will assume that the variable is normally distributed. A z score higher than 3 or lower than -3 would indicate that the value is an outlier.


Key functions in this section,

```
stats.zscore(column, nan_policy='omit')
```
> *The szcore() method normalizes (converts) a numerical variable into Z (normal distribution)*

In [ ]:
# We normalize variable Box Office to check outliers
df_jamesbond["z_Box Office"] = stats.zscore(df_jamesbond["Box Office"],nan_policy='omit').round(2)

In [ ]:
# We select variable and its normalized version and sort
df_jamesbond[["Box Office","z_Box Office"]].sort_values("z_Box Office",ascending=False)
# Note: we do not find any outliers, as there are not Z score values higher than 3 or lower than -3

                                 Box Office  z_Box Office
Film
Skyfall                               943.5          2.61
Thunderball                           848.1          2.06
Goldfinger                            820.4          1.90
Spectre                               726.7          1.36
Casino Royale                         581.5          0.52
From Russia with Love                 543.8          0.30
Moonraker                             535.0          0.25
The Spy Who Loved Me                  533.0          0.24
GoldenEye                             518.5          0.16
You Only Live Twice                   514.2          0.13
Quantum of Solace                     514.2          0.13
Die Another Day                       465.4         -0.15
Tomorrow Never Dies                   463.2         -0.16
Live and Let Die                      460.3         -0.18
For Your Eyes Only                    449.4         -0.24
Dr. No                                448.8         -0.25
Diamonds Are Forever                  442.5         -0.28
The World Is Not Enough               439.5         -0.30
Never Say Never Again                 380.0         -0.64
Octopussy                             373.8         -0.68
The Man with the Golden Gun           334.0         -0.91
Casino Royale                         315.0         -1.02
The Living Daylights                  313.5         -1.03
On Her Majesty's Secret Service       291.5         -1.15
A View to a Kill                      275.2         -1.25
Licence to Kill                       250.9         -1.39

# MERGE DATASETS

# EXERCISES

##### EX 1

> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv

##### Create two new fields in the dataframe,
*   *total_sales* that reflects total sales in all regions
*   *videogame_segment* that flags videogames that sold more than 30MM ("top sales") vs. the rest ("not top sales")

Filter to only videogames for console 'N64' and display columns *name, platform_code, total_sales, videogame_segment* 

---

In [ ]:
import pandas as pd
df_videogames = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/dataset_videogames_games.csv")
df_videogames.dtypes

rank               int64
name              object
platform_code     object
year               int64
genre             object
publisher         object
NA_sales         float64
EU_sales         float64
JP_sales         float64
Other_sales      float64
dtype: object

In [ ]:
df_videogames["total_sales"] = df_videogames["NA_sales"] + df_videogames["EU_sales"] + df_videogames["JP_sales"] + df_videogames["Other_sales"]
df_videogames["videogame_segment"] = np.where(df_videogames["total_sales"]>30,'top_sales','not_top_sales') 

cond = df_videogames["platform_code"] == 'N64'
df_videogames[cond][['name','platform_code','total_sales','videogame_segment']].sort_values('total_sales',ascending=False)

                                       name  ... videogame_segment
46                           Super Mario 64  ...     not_top_sales
63                            Mario Kart 64  ...     not_top_sales
84                            GoldenEye 007  ...     not_top_sales
94     The Legend of Zelda: Ocarina of Time  ...     not_top_sales
157                       Super Smash Bros.  ...     not_top_sales
...                                     ...  ...               ...
14015                     Big Mountain 2000  ...     not_top_sales
14832                         Super Bowling  ...     not_top_sales
14833                           Rat Attack!  ...     not_top_sales
15929                     PGA European Tour  ...     not_top_sales
15933                        Carmageddon 64  ...     not_top_sales

[316 rows x 4 columns]

##### EX 2 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv

##### EX 2.1 Calculate total revenue by sector
##### EX 2.2 Repeat exercise 2.1 but filtering for only companies in sector Technology, Energy or Retailing
---

In [ ]:
import pandas as pd
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object

In [ ]:
# EX 2.1
df_fortune.groupby("Sector").agg(
    {"Revenue":"sum"}
).sort_values("Revenue",ascending=False)

                              Revenue
Sector
Financials                    2217159
Health Care                   1614707
Energy                        1517809
Retailing                     1465076
Technology                    1377600
Food, Beverages & Tobacco      555967
Industrials                    497581
Food and Drug Stores           483769
Motor Vehicles & Parts         482540
Telecommunications             461834
Wholesalers                    444800
Transportation                 408508
Aerospace & Defense            357940
Business Services              272195
Materials                      259145
Chemicals                      243897
Household Products             234737
Media                          220764
Hotels, Resturants & Leisure   169546
Engineering & Construction     153983
Apparel                         95968

In [ ]:
# EX 2.2
cond = df_fortune["Sector"].isin(["Technology","Energy","Retailing"])

df_fortune[cond].groupby("Sector").agg(
    {"Revenue":"sum"}
).sort_values("Revenue",ascending=False)

            Revenue
Sector
Energy      1517809
Retailing   1465076
Technology  1377600

##### EX 3 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv

##### Extract top 5 homeworlds with highest number of characters included in dataframe
---

In [ ]:
import pandas as pd
df_starwars_people = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/starwarsdb_people.csv")
df_starwars_people.dtypes

name           object
height        float64
mass          float64
hair_color     object
skin_color     object
eye_color      object
birth_year    float64
gender         object
homeworld      object
species        object
sex            object
dtype: object

In [ ]:
df_starwars_people.groupby('homeworld').agg({
  "name":"nunique"   
}).rename(
    {"name":"count_characteres"}
    ,axis='columns'
).sort_values('count_characteres',ascending=False)\
.iloc[:5,]

           count_characteres
homeworld
Naboo                     11
Tatooine                  10
Alderaan                   3
Kamino                     3
Coruscant                  3

##### EX 4 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv

##### Aggregate the following metrics by continent,

Agregar las siguiente métricas según continente,

*   *Total population*
*   *Average GDP per capita*
*   *Average % of population living below poberty line*

---

In [ ]:
import pandas as pd
df_who = pd.read_csv('https://data-wizards.s3.amazonaws.com/datasets/dataset_na_who.csv')
df_who.dtypes

Country                                                    object
CountryID                                                   int64
ContinentID                                                 int64
Adolescent fertility rate (%)                             float64
Adult literacy rate (%)                                   float64
Gross national income per capita (PPP international $)    float64
Net primary school enrolment ratio female (%)             float64
Net primary school enrolment ratio male (%)               float64
Population (in thousands) total                           float64
Population annual growth rate (%)                         float64
Population in urban areas (%)                             float64
Population living below the poverty line                  float64
Continent                                                  object
dtype: object

In [ ]:
# EX 4
output = df_who.groupby('Continent').agg({
    'Population (in thousands) total':'sum'
    ,'Gross national income per capita (PPP international $)':'mean'
    ,'Population living below the poverty line':'mean'
})

output['Population (in thousands) total'] = round(output['Population (in thousands) total'])
output['Gross national income per capita (PPP international $)'] = round(output['Gross national income per capita (PPP international $)'])
output['Population living below the poverty line'] = round(output['Population living below the poverty line'])

output.sort_values('Population (in thousands) total',ascending=False)

               Population (in thousands) total  ...  Population living below the poverty line
Continent                                       ...
Asia                                 2859153.0  ...                                      28.0
Europe                                880241.0  ...                                       3.0
Africa                                759147.0  ...                                      36.0
Oceania                               714480.0  ...                                      12.0
South America                         453480.0  ...                                      14.0
North America                         441464.0  ...                                       3.0
Middle East                           336867.0  ...                                       2.0

[7 rows x 3 columns]

##### EX 5 
> Dataset https://data-wizards.s3.amazonaws.com/datasets/movies.csv

##### Extract top 10 directors with highest average IMDB score. Include only directors with more than 5 movies directed.
---

In [ ]:
import pandas as pd
df_movies = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/movies.csv",index_col="movie_title")
df_movies.dtypes

color                         object
director_name                 object
num_critic_for_reviews       float64
duration                     float64
director_facebook_likes      float64
actor_3_facebook_likes       float64
actor_2_name                  object
actor_1_facebook_likes       float64
gross                        float64
genres                        object
actor_1_name                  object
num_voted_users                int64
cast_total_facebook_likes      int64
actor_3_name                  object
facenumber_in_poster         float64
plot_keywords                 object
movie_imdb_link               object
num_user_for_reviews         float64
language                      object
country                       object
content_rating                object
budget                       float64
title_year                   float64
actor_2_facebook_likes       float64
imdb_score                   float64
aspect_ratio                 float64
movie_facebook_likes           int64
dtype: object

In [ ]:
# EX 5
output = df_movies.groupby("director_name").agg({
    "imdb_score":"mean"
    ,"movie_title":"count"
    }).rename({
    "imdb_score":"avg_imdb_score"
    ,"movie_title":"total_movies"
},axis='columns')

output[output['total_movies']>5].sort_values('avg_imdb_score',ascending=False).iloc[:10,]

                       avg_imdb_score  total_movies
director_name
Christopher Nolan            8.425000             8
Quentin Tarantino            8.200000             8
Stanley Kubrick              8.050000             6
James Cameron                7.914286             7
Peter Jackson                7.888889             9
Alejandro G. Iñárritu        7.783333             6
David Fincher                7.750000            10
Martin Scorsese              7.660000            20
Wes Anderson                 7.628571             7
Paul Greengrass              7.585714             7

##### EX 6
> Dataset https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv

##### Create a new field ("company_size") that segments companies in terms of number of employees using the following criteria,
*   *small*, when number of employees is fewer than 10000
*   *medium*, when number of employees is 10000 < x < 100000 
*   *big*, when number of employees is higher than 100000

##### Calculate median revenue by (i) sector and (ii) company size
---

In [ ]:
import pandas as pd
import numpy as np
df_fortune = pd.read_csv("https://data-wizards.s3.amazonaws.com/datasets/fortune1000.csv")
df_fortune.dtypes

Rank          int64
Company      object
Sector       object
Industry     object
Location     object
Revenue       int64
Profits       int64
Employees     int64
dtype: object

In [ ]:
# step 1: creating a new column based on conditions
df = df_fortune
df["company_size"] = np.where(
    df["Employees"]>100000,"big"                      # condition 1
    ,np.where(df["Employees"]>10000,"medium","small"  # condition 2
  )
)

# step 2: parsing the new variable into the groupby
df.groupby(["Sector","company_size"]).agg(
    {"Profits":"median"}
)

                                           Profits
Sector                       company_size
Aerospace & Defense          big            5176.0
                             medium          545.0
                             small           182.0
Apparel                      medium          415.5
                             small           174.0
Business Services            big             169.0
                             medium          419.0
                             small           148.0
Chemicals                    medium         1166.0
                             small           144.5
Energy                       medium          874.0
                             small           118.0
Engineering & Construction   medium          128.0
                             small           167.5
Financials                   big           22894.0
                             medium         1224.0
                             small           473.0
Food and Drug Stores         big            3129.5
                             medium          160.5
                             small            26.0
Food, Beverages & Tobacco    big            5452.0
                             medium          554.5
                             small           260.5
Health Care                  big            2129.0
                             medium          427.0
                             small           204.5
Hotels, Resturants & Leisure big            1293.0
                             medium          161.0
                             small         -1394.0
Household Products           big            7036.0
                             medium          325.0
                             small            89.0
Industrials                  big            2406.0
                             medium          272.5
                             small           108.0
Materials                    medium          274.0
                             small            54.0
Media                        big            8382.0
                             medium          151.0
                             small            64.0
Motor Vehicles & Parts       big            4468.0
                             medium          236.0
                             small           182.0
Retailing                    big            1165.0
                             medium          221.5
                             small            86.0
Technology                   big            7246.0
                             medium          401.0
                             small           321.0
Telecommunications           big           13345.0
                             medium          219.0
                             small           685.0
Transportation               big            4844.0
                             medium          427.0
                             small           226.0
Wholesalers                  medium          395.5
                             small            70.5